Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: གཟུགས་སྟོང་ཞེས་བྱ་བའམ། མི་སྟོང་ཞེས་བྱ་བར་མི་སྤྱོད།
en: They do not engage with the notion that physical forms are empty, or that these are not empty.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་སྟོང་ཞེས་བྱ་བའམ། མི་སྟོང་ཞེས་བྱ་བར་མི་སྤྱོད།
en: Similarly, they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are empty, or that these are not empty.

source: གཟུགས་མཚན་མ་ཡོད་ཅེས་བྱ་བའམ། མཚན་མ་མེད་ཅེས་བྱ་བར་མི་སྤྱོད།
en: They do not engage with the notion that physical forms are with signs, or that they are signless.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་མཚན་མ་ཡོད་ཅེས་བྱ་བའམ། མཚན་མ་མེད་ཅེས་བྱ་བར་མི་སྤྱོད།
en: Similarly, they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are with signs, or that these are signless.

source: གཟུགས་སྨོན་པ་ཡོད་ཅེས་བྱ་བའམ། སྨོན་པ་མེད་ཅེས་བྱ་བར་མི་སྤྱོད།
en: They do not engage with the notion that physical forms have aspirations, or that they are without aspirations.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་སྨོན་པ་ཡོད་ཅེས་བྱ་བའམ། སྨོན་པ་མེད་ཅེས་བྱ་བར་མི་སྤྱོད།
en: Similarly, they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness have aspirations, or that they are without aspirations.

source: གཟུགས་ཞི་ཞེས་བྱ་བའམ། མ་ཞི་ཞེས་བྱ་བར་མི་སྤྱོད།
en: They do not engage with the notion that physical forms are calm, or that they are not calm.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཞི་ཞེས་བྱ་བའམ། མ་ཞི་ཞེས་བྱ་བར་མི་སྤྱོད།
en: Similarly, they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are calm, or that they are not calm.

source: གཟུགས་དབེན་ཞེས་བྱ་བའམ། མི་དབེན་ཞེས་བྱ་བར་མི་སྤྱོད།
en: They do not engage with the notion that physical forms are void, or that they are not void.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་དབེན་ཞེས་བྱ་བའམ། མི་དབེན་ཞེས་བྱ་བར་མི་སྤྱོད།
en: Similarly, they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are void, or that they are not void.

source: གཟུགས་ཀུན་ནས་ཉོན་མོངས་ཞེས་བྱ་བའམ། རྣམ་པར་བྱང་ཞེས་བྱ་བར་མི་སྤྱོད།
en: They do not engage with the notion that physical forms are afflicted, or that they are purified.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཀུན་ནས་ཉོན་མོངས་ཞེས་བྱ་བའམ། རྣམ་པར་བྱང་ཞེས་བྱ་བར་མི་སྤྱོད།
en: Similarly, they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are afflicted, or that they are purified.

source: གཟུགས་སྐྱེ་ཞེས་བྱ་བའམ། མི་སྐྱེ་ཞེས་བྱ་བར་མི་སྤྱོད།
en: They do not engage with the notion that physical forms arise, or that they are non-arising.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་སྐྱེ་ཞེས་བྱ་བའམ། མི་སྐྱེ་ཞེས་བྱ་བར་མི་སྤྱོད།
en: Similarly, they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness arise, or that they are non-arising.

source: གཟུགས་འགག་ཅེས་བྱ་བའམ། མི་འགག་ཅེས་བྱ་བར་མི་སྤྱོད།
en: They do not engage with the notion that physical forms cease, or that they are unceasing.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་འགག་ཅེས་བྱ་བའམ། མི་འགག་ཅེས་བྱ་བར་མི་སྤྱོད།
en: Similarly, they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness cease, or that they are unceasing.

source: གཟུགས་དངོས་པོ་ཡོད་ཅེས་བྱ་བའམ། དངོས་པོ་མེད་ཅེས་བྱ་བར་མི་སྤྱོད།
en: They do not engage with the notion that physical forms are entities, or that they are non-entities.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་དངོས་པོ་ཡོད་ཅེས་བྱ་བའམ། དངོས་པོ་མེད་ཅེས་བྱ་བར་མི་སྤྱོད་པ་སྟེ།
en: Similarly, they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are entities, or that they are non-entities.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ན། ཐབས་ལ་མཁས་པར་རིག་པར་བྱའོ། །
en: “Venerable Śāradvatī­putra, when bodhisattvas practice the transcendent perfection of wisdom in that manner one should know that they are endowed with skillful means.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་གཟུགས་མ་ཡིན།
en: If you were to ask why, Venerable Śāradvatī­putra, it is because the emptiness of physical forms is not physical forms.

source: གཟུགས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད། སྟོང་པ་ཉིད་ལས་གུད་ན་ཡང་གཟུགས་མེད་དེ།
en: Emptiness is not other than physical forms, nor are physical forms other than emptiness.

source: གཟུགས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ཡིན་ལ། སྟོང་པ་ཉིད་ཀྱང་གཟུགས་ཡིན་པ་དང་།
en: The nature of physical forms is indeed emptiness, and emptiness is indeed physical forms.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ཡང་རྣམ་པར་ཤེས་པ་མ་ཡིན།
en: Similarly, the emptiness of feelings, perceptions, formative predispositions, and consciousness is not consciousness [and the other aggregates].

source: རྣམ་པར་ཤེས་པ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད། སྟོང་པ་ཉིད་ལས་གུད་ན་ཡང་རྣམ་པར་ཤེས་པ་མེད་དེ།
en: Emptiness is not other than consciousness, nor is consciousness other than emptiness.

source: སྟོང་པ་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པ་ཡིན་ལ།
en: Emptiness is indeed consciousness.

source: རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ཡིན་པའི་ཕྱིར་རོ།
en: The nature of consciousness is indeed emptiness.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་བར་གྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་དག་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མ་ཡིན།
en: In the same vein, the emptiness of [the meditative experiences], up to and including the applications of mindfulness, is not the applications of mindfulness [and the rest].

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད། སྟོང་པ་ཉིད་ལས་གུད་ན་ཡང་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མེད་དེ།
en: Emptiness is not other than the applications of mindfulness, nor are the applications of mindfulness other than emptiness.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ཡིན་ལ།
en: The nature of the applications of mindfulness is indeed emptiness.

source: སྟོང་པ་ཉིད་ཀྱང་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཡིན་ནོ། །
en: Emptiness is indeed the applications of mindfulness.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་གྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མ་ཡིན།
en: In the same vein, that which is empty of [the other causal attributes], up to and including the noble eightfold path, is not the noble eightfold path [and the rest].

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད། སྟོང་པ་ཉིད་ལས་གུད་ན་ཡང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མེད་དེ།
en: Emptiness is not other than the noble eightfold path, nor is the noble eightfold path other than emptiness.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ཡིན་ལ།
en: The nature of the noble eightfold path is indeed emptiness.

source: སྟོང་པ་ཉིད་ཀྱང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡིན་ནོ། །
en: Emptiness is indeed the noble eightfold path.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའི་བར་ཡང་གཞན་མ་ཡིན། སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན།
en: Similarly, [the other attributes], up to and including the ten powers of the tathāgatas, are not one thing and emptiness another.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད་སྟོང་པ་ཉིད་ལས་གུད་ན་ཡང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་མེད་དེ།
en: Emptiness is not other than the ten powers of the tathāgatas, nor are the ten powers of the tathāgatas other than emptiness.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཉིད་སྟོང་པ་ཉིད་ཡིན་ལ།
en: The nature of the ten powers of the tathāgatas is indeed emptiness.

source: སྟོང་པ་ཉིད་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡིན་ནོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: Emptiness is indeed the ten powers of the tathāgatas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་གྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་མ་ཡིན།
en: In the same vein, the emptiness of the [other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, is not the eighteen distinct qualities of the buddhas [and the rest].

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད། སྟོང་པ་ཉིད་ལས་གུད་ན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་མེད་དེ།
en: Emptiness is not other than the eighteen distinct qualities of the buddhas, nor are the eighteen distinct qualities of the buddhas other than emptiness.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ཡིན་ལ།
en: The nature of the eighteen distinct qualities of the buddhas is indeed emptiness.

source: སྟོང་པ་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཡིན་ནོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན་སྤྱོད་དོ་ཞེས་བྱ་བར་ཁས་མི་ལེན། མི་སྤྱོད་དོ། །
en: Emptiness is indeed the eighteen distinct qualities of the buddhas.

source: ཞེས་བྱ་བར་ཁས་མི་ལེན། སྤྱོད་ཀྱང་སྤྱོད་ལ། མི་སྤྱོད་ཀྱང་མི་སྤྱོད་ཅེས་བྱ་བར་ཁས་མི་ལེན། སྤྱོད་པ་ཡང་མ་ཡིན་མི་སྤྱོད་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བར་ཁས་མི་ལེན་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་སྐལ་བ་དང་ལྡན་པ་ཡིན་ནོ། །
en: “Venerable Śāradvatī­putra, if great bodhisattva beings, when they practice the transcendent perfection of wisdom, do not accept that are practicing, do not accept that they are not practicing, do not accept that they are both practicing and not practicing, and do not accept that they are neither practicing nor not practicing, then great bodhisattva beings who practice the transcendent perfection of wisdom in that manner will have the good fortune to actualize manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན་ཐམས་ཅད་དུ་ཁས་མི་ལེན།
en: Then the venerable Śāradvatī­putra addressed the venerable Su­bhūti as follows: “Venerable Su­bhūti, why is it that great bodhisattva beings, when [skillfully] practicing the transcendent perfection of wisdom, do not accept anything at all?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེའི་ངོ་བོ་ཉིད་དམིགས་སུ་མེད་དོ། །
en: He replied, “Venerable Śāradvatī­putra, the essential nature of that transcendent perfection of wisdom is non-apprehensible.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་ཏེ།
en: If you ask why, it is because the transcendent perfection of wisdom is the essential nature of non-entity.

source: ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན་ཁས་མི་ལེན་ཏོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། སྤྱོད་པ་ཡང་མ་ཡིན། མི་སྤྱོད་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་དེ་ལྟ་བུར་ཡང་ཁས་མི་ལེན་ཏོ། །
en: Śāradvatī­putra, for this reason, when great bodhisattva beings practice the transcendent perfection of wisdom, they do not accept that they are practicing, and in the same vein, they do not accept that they are neither practicing nor not practicing [and so forth].

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་རྗེས་སུ་ཞུགས་པ་དང་། གཟུང་བ་མེད་པའི་ཕྱིར་ཏེ།
en: If you ask why, it is because they have followed the principle that all things have the essential nature of non-entity, and therefore they have not appropriated them.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན། ཆོས་ཐམས་ཅད་ཉེ་བར་ལེན་པ་མེད་པ་རྒྱ་ཆེ་བའི་ཡོ་བྱད་ཚད་མེད་པར་གཏོགས་པ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་མ་ཡིན་པ་སྟེ།
en: This is the meditative stability of great bodhisattva beings, non-acquisitive with respect to all things—the spacious, immeasurable, and indefinable method which is not shared in common with all the śrāvakas and pratyekabuddhas.

source: ཏིང་ངེ་འཛིན་འདི་ཉིད་དང་མ་བྲལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ། བམ་པོ་བཅུ་གཉིས་པ།
en: Great bodhisattva beings who are not separated from this meditative stability will swiftly attain manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་ཁོ་ན་དང་མ་བྲལ་ཞིང་ལྡན་པ། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའམ། འོན་ཏེ་ཏིང་ངེ་འཛིན་གཞན་དག་གིས་ཀྱང་འཚང་རྒྱ།
en: Then the venerable Śāradvatī­putra addressed the venerable Su­bhūti as follows: “Venerable Su­bhūti, is it that only great bodhisattva beings who possess and are never separated from this meditative stability will swiftly attain manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment, or else, are there other meditative stabilities through which buddhahood will be attained?”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་དེ་ལ་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཏིང་ངེ་འཛིན་གཞན་དག་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: The venerable Su­bhūti replied, “Venerable Śāradvatī­putra, great bodhisattva beings who abide in other meditative stabilities will also swiftly attain manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment.”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཏིང་ངེ་འཛིན་གང་དག་ལ་གནས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར།
en: “Venerable Su­bhūti,” he continued, “abiding in which meditative stabilities will great bodhisattva beings swiftly attain manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་དཔའ་བར་འགྲོ་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Venerable Śāradvatī­putra, (1) there is the meditative stability of great bodhisattva beings named Heroic Valour.

source: དེ་ལ་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: Abiding therein, great bodhisattva beings will swiftly attain manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། རིན་ཆེན་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ། །
en: In the same vein, (2) there is the meditative stability named Precious Seal.

source: སེང་གེ་རྣམ་པར་རྩེ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ། །
en: (3) There is the meditative stability named Lion’s Play.

source: ཟླ་བ་བཟང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ། །
en: (4) There is the meditative stability named Beautiful Moon.

source: ཟླ་བའི་རྒྱལ་མཚན་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ། །
en: (5) There is the meditative stability named Crest of the Victory Banner of the Moon.

source: ཆོས་ཐམས་ཅད་ལས་ཤིན་ཏུ་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (6) There is the meditative stability named Surpassing All Phenomena.

source: སྤྱི་གཙུག་བལྟར་མི་མཐོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (7) There is the meditative stability named Unseen Pinnacle.

source: ཆོས་ཀྱི་དབྱིངས་སུ་ངེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (8) There is the meditative stability named Certainty in the Expanse of Reality.

source: ངེས་པའི་རྒྱལ་མཚན་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (9) There is the meditative stability named Crest of the Victory Banner of Certainty.

source: ངེས་པའི་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྡོ་རྗེ་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (10) There is the meditative stability named Adamantine.

source: ཆོས་ལ་འཇུག་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (11) There is the meditative stability named Seal of Entry into All Phenomena.

source: ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ལྟར་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (12) There is the meditative stability named Consecrated as a King of Meditative Stability.

source: རྒྱལ་པོའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (13) There is the meditative stability named Seal of the King.

source: བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (14) There is the meditative stability named Power of Perseverance.

source: ཡང་དག་པར་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (15) There is the meditative stability named Sublimation [of All Things].

source: ངེས་པའི་ཚིག་ལ་གདོན་མི་ཟ་བར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (16) There is the meditative stability named Definitive Engagement in Precise Lexical Explanation.

source: ཚིག་བླ་དགས་ལ་འཇུག་ཅིང་ཕྱོགས་ལ་རྣམ་པར་ལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (17–18) There are the meditative stabilities named Entry into Designations and Observation of Spatial Directions.

source: གཟུངས་ཀྱི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (19) There is the meditative stability named Seal of Dhāraṇī.

source: བརྗེད་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (20) There is the meditative stability named Unimpaired.

source: ཆོས་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་རྒྱ་མཚོའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (21) There is the meditative stability named Oceanic Seal Gathering All Phenomena.

source: ནམ་མཁའ་ཁྱབ་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (22) There is the meditative stability named Permeation of Space.

source: རྡོ་རྗེའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (23) There is the meditative stability named Indestructible Maṇḍala.

source: རྒྱལ་མཚན་གྱི་རྩེ་མོའི་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (24) There is the meditative stability named [Shoulder Ornament of] the Victory Banner’s Crest.

source: དབང་པོའི་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (25) There is the meditative stability named Crest of Power.

source: རྒྱུན་གྱི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (26) There is the meditative stability named Pursuit of the Stream.

source: སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (27) There is the meditative stability named Yawning Lion.

source: བཀོད་པ་བསྒྲུབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (28) There is the meditative stability named Establishment of the Array.

source: རིན་ཆེན་འབྱུང་གནས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (29) There is the meditative stability named Precious Source.

source: རྣམ་པར་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (30) There is the meditative stability named Illumination.

source: ཚོལ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (31) There is the meditative stability named Unseeking.

source: གནས་ལ་རྟེན་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (32) There is the meditative stability named No Fixed Abode.

source: སེམས་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (33) There is the meditative stability named Free from Mentation.

source: དྲི་མ་མེད་པའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (34) There is the meditative stability named Taintless Lamp.

source: སྣང་བ་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (35) There is the meditative stability named Boundless Light.

source: སྣང་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (36) There is the meditative stability named Illuminator.

source: དག་པ་དམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (37) There is the meditative stability named Pure Sanctuary.

source: འོད་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (38) There is the meditative stability named Immaculate Light.

source: དགའ་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (39) There is the meditative stability named Bringer of Joy.

source: གློག་གི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (40) There is the meditative stability named Lightning Lamp.

source: ཟད་མི་ཤེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (41) There is the meditative stability named Unconquerable.

source: གཟི་བརྗིད་ཡོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (42) There is the meditative stability named Majestic.

source: ཟད་པ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (43) There is the meditative stability named Free from Extinction.

source: ངེས་པར་རྒྱལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (44) There is the meditative stability named Unvanquished.

source: རྣམ་པར་འཇོམས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (45) There is the meditative stability named Subdued.

source: ཉི་མའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (46) There is the meditative stability named Lamp of the Sun.

source: ཟླ་བའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (47) There is the meditative stability named Lamp of the Moon [or Immaculate Moon].

source: སྣང་བ་དག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (48) There is the meditative stability named Pure Appearance.

source: མཆོག་གི་འབྱུང་གནས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (50) There is the meditative stability named Supreme Source.

source: ཡེ་ཤེས་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (51) There is the meditative stability named Crest of Gnosis.

source: སེམས་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (52) There is the meditative stability named Stability of Mind.

source: ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (53) There is the meditative stability named Total Illumination.

source: རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (54) There is the meditative stability named Consecrated.

source: རིན་ཆེན་མཐའ་ཡས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (55) There is the meditative stability named Jewel Cusp.

source: ཆོས་དམ་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (56) There is the meditative stability named Seal of the Sacred Doctrine.

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (57) There is the meditative stability named Sameness of All Things.

source: དགའ་བ་སྤོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (58) There is the meditative stability named Renunciation of Delight.

source: ཆོས་ཀྱིས་གནས་པའི་སྤྱི་གཙུག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (59) There is the meditative stability named Sublimation of [All] Phenomena.

source: རྣམ་པར་འཐོར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (60) There is the meditative stability named Dispersal.

source: ཚིག་ཐམས་ཅད་རབ་ཏུ་འབྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (61) There is the meditative stability named Distinguishing the Terms Associated with All Phenomena.

source: ཡི་གེ་མཉམ་པར་འགོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (62) There is the meditative stability named Establishing the Sameness of All Letters.

source: ཡི་གེ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (63) There is the meditative stability named Devoid of Letters.

source: དམིགས་པ་གཅོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (64) There is the meditative stability named Eradication of Referents.

source: རྣམ་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (65) There is the meditative stability named Unmodified.

source: མིང་ངེས་པར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (66) There is the meditative stability named Ascertainment of Names.

source: གནས་མེད་པར་སྤྱོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (67) There is the meditative stability named Roaming.

source: རབ་རིབ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (68) There is the meditative stability named Devoid of Darkness.

source: སྤྱོད་པ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (69) There is the meditative stability named Engaging in Conduct.

source: གཡོ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (70) There is the meditative stability named Unwavering.

source: ཡུལ་ལས་རྒལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (71) There is the meditative stability named Transcendence of the Range.

source: ཡོན་ཏན་ཐམས་ཅད་ཀྱི་ཚོགས་སུ་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (72) There is the meditative stability named Accumulation of All Attributes.

source: སེམས་མེད་པར་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (73) There is the meditative stability named Abiding Without Mentation.

source: དགེ་བའི་མེ་ཏོག་རྒྱས་ཤིང་དག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: (74) There is the meditative stability named Blossoming and Purity of the Flowers of Virtue.
